[
  {
      "gametitle": "Donkey Kong Country 2",
      "songname": "Stickerbrush Symphony",
      "composername": "David Wise",
      "releaseyear": 1995,
      "image": "dkc",
      "url": "https://www.youtube.com/watch?v=lndBgOrTWxo&ab_channel=TerraBlue",
      "comment1": "38 years old, hanging in there. The kid who played these games is still here.",
      "comment2": "I was 13 years old. It was Christmas Eve 1995. I remember getting up around 7 am and played this game before I went to my grandma's for Christmas. It reminds me of better, simpler times.",
      "comment3": "I remember playing this game when I was a kid and my dad was dying of lung cancer. This specific level’s soundtrack touched me then and it still effects me to this day. So a work of art my heart is singing to this melody.",
      "comment4": "It reminds me of my homie Max who passed away twenty years ago. We played the game every day. Rest in Peace Max. I hope, that we will see us again on the other side.",
      "comment5": "I remember this track. This reminds me of being a kid again, I’m 35 now married with a house and puppies. Sometimes it’s scary to realize how time keeps going and doesn’t stop for anyone. I hope everyone listening to this and reading the comments grows old, happy and healthy.",
      "comment6": "Im passing through hard times rn. Divorce, my children going to live with the mother, I might comeback to my mother´s house, felling the depression symptons coming back also. Its not easy, but for some reason, when I start to listening to this song, everything gets better. It send me back on time. Just me, my SNES and happy moments. I have faith that one day things will get better",
      "comment7": "This might sound strange for some but I think the awe and nostalgic feeling this beautiful music brings forth on people actually helps coping with the inevitability of growing older and even death.\nQuoting from a wise person who once said: \"Don't be sad that it's over. Be happy that it happened.\"",
      "comment8": "This track reminds me when all i looked forward to was waiting for weekend to go blockbuster i was in middle school, i remember i would find peace playing snes being that my older brother was invovled with a street gang in los angeles during the 1990s gang murder rates were all time high! He would tell play your snes im gonna go hangout with the homeboys ill see you tomorrow, i would just start playing snes and then pray my older brother doesnt get life in prison or get murdered, All this was back in 1997. My older brother is a engineer now and he changed his life in 2003 and has 4 great intelligent kids the oldest is almost finished with college. I am also father and succesful.",
      "comment9": "Even though I didn't exist when this game was popular, this song still brings back childhood memories. :)",
      "comment10": "This song always reminds me of my dad... I was just a kid and everything was so easy. Even to ignore some feelings. Now, years after both the happy days of my childhood and the passing of someone that was so important to me as my father was, I can see that our lives are so short and that only time can make us realize some important moments that otherwise in other moment would be just...normal. I miss my father and I miss the old times...",
      "comment11": "I was 5 years old and would run into my family game room and watch my dad play and watch my brothers watching him and cheering him on and I remember only wishing I could play too instead of appreciating what I had in front of me at the time. Rip",
      "comment12": "God, I need to spend more time with my Dad...",
      "comment13": "I want my family to play this song at my funeral.",
      "comment14": "Life hurts these days, good to know I can revisit something that brought me the joy I had in my innocence. David Wise an absolute unit of a 90's composer",
      "comment15": "Been feeling really down today about my last relationship. 6 1/2 years and a promised marriage, gone. I knew in my heart he wouldn't be the man I needed. If we ever had kids he would of neglected them. This song helps me cry it out."
  },
  {
      "gametitle": "Zelda: Ocarina of Time",
      "songname": "Title Theme",
      "composername": "Koji Kondo",
      "releaseyear": 1998,
      "image": "ocarina.jpeg",
      "url": "https://www.youtube.com/watch?v=CKA1zCwcYBE&list=PLpDcpnnz7Pdb5N7t6nB6pxxPTkk-25tgO&index=5&ab_channel=Halo2playa",
      "comment1": "My uncle bought my brother and I this game for Christmas 1999. I wasn’t good at it so I just enjoyed watching my brother play it almost every day after school. I don’t think he ever beat the 2 save files that he had saved, mine being the 3rd. He passed away this past spring at 29 years old, and while I don’t have the cartridge back yet I’ll be damned if I don’t finally finish this game for the two of us.",
      "comment2": "“Time passes, people move. Like a river's flow, it never ends. A childish mind will turn to noble ambition. Young love will become deep affection.”",
      "comment3": "This is the exact meaning of “Don’t cry because it’s over, smile because it happened”",
      "comment4": "Being a kid or a teenager in the late 90s was pure magic my people.",
      "comment5": "RIP brother you will be surely missed and loved forever. 1990-2022.",
      "comment6": "This song is just full of sadness and magic at the same time it makes me cry. This game is the reason why my little brother and I got into The Legend of Zelda. Reminds me of the beautiful memories that my little brother and I shared together when we were young. I miss him so much, I hope he’s happy and i hope he can forgive me for all the bad times we had. We’ve had so many good times, but they’re just at times painful to look back on. I love you so much little brother, everyday I have to wake up to silence and an empty bed. I can only find you in my memories and in our childhood video games.",
      "comment7": "I remember a few years back me and my dog were on the porch listening to this. It was just a nice little moment between the two of us . Its been three months since he was put to sleep. I miss you stryker",
      "comment8": "This song is turning everyone into a philosopher",
      "comment9": "Instantly cried when I heard this. This game blew my mind as an adolescent. Great memories.",
      "comment10": "the players will change while the game stays the same.\nthis is what listening to this timeless track makes me feel.",
      "comment11": "why does it hurt hearing this? Its such a beautiful song.",
      "comment12": "The best thing about going back to this game 24 years later? When your children ask to play this alongside you and they enjoy it just as much as you did when you were their age. That for me, completes the nostalgia I feel whenever I play these classics.",
      "comment13": "I wasn't born until 2003. But God damn this is the most nostalgic thing to me. Makes me cry almost.  This game means everything to me",
      "comment14": "This song makes me feel like I’m in a field of grass. The sun is great, the roses smell good as ever, the trees wave at me, the blue sky surrounds me, and I also see a bunny hopping it’s way to who knows. Like all my life problems just went away.",
      "comment15": "Flawless and beautiful… I never really appreciated this as a child"
  },
  {
      "gametitle": "Kingdom Hearts",
      "songname": "Dearly Beloved",
      "composername": "Yoko Shimomura",
      "releaseyear": 2002,
      "image": "kingdomHrt.jpeg",
      "url": "https://www.youtube.com/watch?v=g25QXnhVijQ&list=PLpDcpnnz7Pdb5N7t6nB6pxxPTkk-25tgO&index=1&ab_channel=Yoshio808",
      "comment1": "This song is beautiful and brings out so many elements and aspects and can be interpreted in so many ways... it just puts me at peace",
      "comment2": "To everyone in the comments. I don't know you and you don't know me but this song makes me feel feelings. Back to a simpler time it's nostalgic and the not because of the game but this puts out those emotions i feel like i'm home but i know i can't stay. I don't know you but i feel as if i do. In a way i feel as if all of you are my family one way or another. sniff I love you guys!",
      "comment3": "Wow... this came on by accident. I knew instantly what it was and it hit home. The nostalgia poured in so quick. These were the days. <3",
      "comment4": "This music will always have a special place in my heart. One time when I was a kid I turned on the game just to close my eyes and listen to this.",
      "comment5": "A picture holds a thousand words, a song holds a million memories, this games holds my childhood",
      "comment6": "I would just sit in the loading screen and listen to this song over and over as a kid. Wish I could just relive those times, playing video games with my brother and knowing what it's like to be a kid. Be care free and not have to worry about the hardships that we'll face in life... all that was on our minds was beating KH together.",
      "comment7": "Still remember that magical feel you got the first time you put in that disc in the PS2 and soon got to heard this beautiful theme for the first time ever.",
      "comment8": "I remember getting this back in 2002.  It was one of the best days of my life.  I remember staying home sick one day and then beating the game, and that song that was playing while you were watching those clips of what happened in the worlds you visited.  It brought tears to my eyes and still does.  Kingdom Hearts is the only game so far to do that to me.",
      "comment9": "I love how you can hear the waves in the background. It's so relaxing...",
      "comment10": "OMG The memories...\nEverything was better that time...",
      "comment11": "Oh God!! the Nostalgia is coming out of my eyes in the form of water! Such a melancholic and beautiful melody.",
      "comment12": "Oh man the song just gives me a wave of emotions and makes me want to remember each moment of it.",
      "comment13": "I remember playing the first game in my basement eight years ago...I was twelve...a young child with the entire world in my sights. This song brings back more than just memories of a game...it brings me back to a time where there was no need for a job, college, bills, bullshit. This game will forever be linked to my childhood. Who knew a simple tune could nearly bring a person to tears...",
      "comment14": "damn this takes me back. my cousin used to live at my house and she had this game, she would tell me not to watch her playing it because of the violence and i was so young. but when she moved out she forgot to take the game, and i played it. i got so into it, it's such a beautiful game. then, one time i played this tune on a piano for her, and was like \"remember this?\" and she was surprised. she had no idea how i knew the tune. lol",
      "comment15": "This song is my lullaby. I don't know why. It still is! ..."
  },
  {
      "gametitle": "Chrono Trigger",
      "songname": "Corridors of Time",
      "composername": "Yasunori Mitsuda",
      "releaseyear": 1995,
      "image": "chronoTrig.png",
      "url": "https://www.youtube.com/watch?v=BXo3DrXHY8w&list=PLpDcpnnz7Pdb5N7t6nB6pxxPTkk-25tgO&index=9&ab_channel=phoenix3065",
      "comment1": "Checkpoint: Here I am, in my thirties, listening to this song again, from a game that marked a generation and that makes me think about going back in time to today! My life was one of the best, but today depression takes over, sometimes I try to recover, but not everyone around me wants peace. Someday I will come back here to write that everything worked out and that I overcame depression!",
      "comment2": "This song... The time machine that takes me back to the past its so powerful ♥️ love chrono trigger",
      "comment3": "everytime I hear this song I always remember when my little sister was still alive.. haha such good memories",
      "comment4": "This takes me back …",
      "comment5": "Don't let your bitterness cloud the beauty or hope from vision, especially if that bitterness is well earned.",
      "comment6": "My funeral song put this itch on loop!",
      "comment7": "It is a Monday.  I'm listening to a song many years older than I am. I am feeling nostalgic for a time u have yet to experience.  I feel like I was born right when everything went to shit. I'm now going to start college in a month. Amendments are being repealed,  schools are being shot up, and the world is heating up. It feels like there is no longer anything positive In this world. Sometimes it makes you want to give up, but tomorrow comes. It always does, because it must. Never give up, because it can't get worse than it is right now.",
      "comment8": "I'm 26 here in Australia drinking by myself because my life's a mess, i guess it's time to clean it up\n",
      "comment9": "Beautiful piece of music. there is a sadness in it that works as a function to portray the tragedy and state of zeal, an ideological \"utopia\" that existed at the expense of all the inhabitants below.",
      "comment10": "Rest in peace, Taia777. o7",
      "comment11": "It's a Tuesday.  I sit here writing this, feeling a sense of deja vu. College could be going better, but it could be going a lot worse. I have never cared about March in my entire life, and now it's all I look forward to. When you have some9ne to love, you change. I have never missed anyone more than my partner, and while I will see them in 11 days, it feels like a Lifetime away. \n\nNever give up",
      "comment12": "Age 29. Just had a physical and I'm over 30kg overweight; I can't drive yet so I can't be with my partner of 7 years in person; I'm working a job with limited move-up... Despite these facts, I'm going to go into this new era of my life fighting for it.",
      "comment13": "bring me to 1995!!!!\n",
      "comment14": "Checkpoint: 3/6/23. 24 years old. I first listened to this song when I was still in college. I was in a shitty relationship, I was depressed, and struggling with my classes. That was around three years ago. Today, I am so much happier. I found the right medication and therapy to treat my depression, I'm happily single, I have a good job, and a house! It's kind of lonely though, all my friends moved away post-college, I feel kind of isolated. Things aren't perfect but I never knew I could feel this light. Here's hoping things get even better next time around. ",
      "comment15": "Im a 19, soon turning 20 year old trans guy. a friend of mine pointed me to this video, saying it felt like a theme song for if life had a literal pause menu. i feel like i'm in that pause menu right now. i have adhd and depression, and i often forget to take my meds. when that happens the world turns into a timeless slog. there's a larger \"pause\" as well, i feel like i'm behind on everything- registering for college classes, getting a job, learning to drive, finding a doctor to start my transition- and i don't know how to \"unpause\". i'm afraid i'll stay stuck this way forever."
  },
  {
      "gametitle": "Katamari Damacy",
      "songname": "Lonely Rolling Star",
      "composername": "Saki Kabata",
      "releaseyear": 2004,
      "image": "katamari.jpeg",
      "url": "https://www.youtube.com/watch?v=7_QydNXI_ok&list=PLpDcpnnz7Pdb5N7t6nB6pxxPTkk-25tgO&index=11&ab_channel=MoyaBaumb",
      "comment1": "First listened to this song durning middle school when my friend brought over Katamari one time. So touching, still makes me cry sometimes when I hear it. This song inspired me to learn Japanese. Now I’m almost 30, live in Japan, and I see all the things I used to roll up and turn into stars. Funny how life goes sometimes. I also majored Astrophysics which, come to think of it, is quite fitting.",
      "comment2": "My father showed this song to me like 3 years ago and we played katamari together after he showed me this song I'm so glad we have gotten more close together I never had someone like him he actually gives me good advice we always play games together we are closer than ever he's my only friend because I don't have any he helps me cope and things like that I love you dad :)",
      "comment3": "This game is a cherished part of my childhood...\n\nWhenever my older cousin would come over I would get really excited when we would play this together. She was a lot older than me (about a decade more), so she ended up moving away to California not too long after and I never get to see her anymore. Now, listening to this song reminds me of her. I hope she’s doing well and I can see her again some day... something about it kind of makes me want to cry. But... in a bittersweet kind of way? like a crying, but smiling, thinking of the memories way...",
      "comment4": "No one can deny it. There is a beauty to things that don't last forever. A sadness for the impermanence of things.. But a happiness to feel that we all were able to witness and experience it. To cherish those fleeting dreams.. And to appreciate them for what they were. Such is life. So.. To those out there reading this: Keep on rolling. Reach for your dreams that lay beyond the stars. No matter what happens.. It'll be okay. It will be okay.",
      "comment5": "Its a very Buddhist theme of balance. Its like we want be with people we love some times. That's sad. But the best thing will always be to let go and wish them the best. Yes its lonely, but it doesn't mean we can't be happy. \n\nJust like a song can be deep but also just a fun song on a video game.",
      "comment6": "This song is about two lovers. The singer is singing about how it's in her lover's nature to roll and wander around, and eventually apart from her. She accepts this and waits for her lover, because she knows that her lover will always\r\n\r\neventually\r\n\r\ncome\r\n\r\nrolling\r\n\r\nback\r\n\r\nto her.",
      "comment7": "I have never played this game... but I still have nostalgia for it. Through the music alone.\n",
      "comment8": "This is strangely calming, it's not happy but it's not sad... It's simply serene.....\n",
      "comment9": "I always loved this song from the original Katamari game I grew up playing with my father and sister. Recently I moved overseas to properly start my solo life far from home... And now re-listening to it and re-discovering the lyrics, I just can't help but calling them and catching up with them.\n\nThe lyrics \"Now, face forward and go\" (Saa, Mae wo muite ikou),  \"Don't give up, alright?\" (Akiramenaideyo, ne?) and \"Gimme a call sometimes\"(Tama ni wa denwa shite) especially pull on the heart strings.",
      "comment10": "Me and my best friend went half and half on this game on release without knowing what it was. This song has stuck with me for over half my life.\n",
      "comment11": "I’m listen to this when I’m on the verge of losing it.\n",
      "comment12": "I'm is aware that I need to let her go but a little part of me is still attached to the idea of her someday returning... I truly believe that life is just about rolling with people but always be aware that at the end of the day you need to roll things alone, so you are constantly a Lonely Rolling Star... It's been really difficult for me to overcome this broken heart, but until the next person arrives, ill be rolling by myself :)",
      "comment13": "I’ll never forget the day when I first sat down to play Katamari and this song came on. It was the first time I went and bought an actual sound track to a video game. Damn, that was like 13 years ago...\n",
      "comment14": "this song is carrying me through my depression.\n",
      "comment15": "I find it amazing how everyone is expressing their thoughts and feeling on this song in the comments. Despite most having a language barrier, we all felt the same feeling together just by listening to the song and how the singer expressed this bittersweet tone that I think it’s hard to even expressed just in speaking. Shows you how powerful music is and how no matter what language you speak, music will touch you all in the same"
  },
  {
      "gametitle": "Animal Crossing: Wild World",
      "songname": "Title Screen",
      "composername": "Kazumi Totaka",
      "releaseyear": 2005,
      "image": "acWW.jpeg",
      "url": "https://www.youtube.com/watch?v=PTcnHByNva0&list=PLpDcpnnz7Pdb5N7t6nB6pxxPTkk-25tgO&index=12&ab_channel=DJAbyss500",
      "comment1": "I just didn’t expect a wave of nostalgia flowing over me, and yes I’m crying\n",
      "comment2": "Omg I used to just leave my DS on the title screen and listen to this and the little voice that said “nintendo” was my fav. ♥ glad I was able to come back to it years and years later ♥",
      "comment3": "Nostalgia floats with me this quiet and calm night. A song of my youth plays its familiar tune. Cold wind sweeps by. A lovely night indeed.\n",
      "comment4": "I still fondly remember the summer nights I stayed up late at night playing games like this and Pokémon platinum. I miss those times\n",
      "comment5": "I remember listening to this song with my ex fiancee one night before I had to go away to another country for months. We hugged on the floor of our room and just cried together while we listened to the songs that helped her fall asleep at night. This song will always be magical to me and will always remind me of that ",
      "comment6": "These are the feelings I want to live for, these are what we stay alive for. \nI want to create and help make more people feel like this because, to me, there are not many things as beautiful\n",
      "comment7": "when i hear this song then i feel like LIFE IS WONDERFUL!\nAWESOME\n",
      "comment8": "Actually Best game music in existence. This is beautiful! :'( This song hurts my heart more then having a fricking heart attack! This is the best...\nI miss my old friends.... Goodbye ",
      "comment9": "Makes me feel happy, I’ll come back here someday...\n",
      "comment10": "My heart, I CANT TAKE THESE FEELS IM FEELING\n",
      "comment11": "This makes me miss those endless summers playing wild world with my friends. I miss my town. I can't even remember what I called it. It's long gone now",
      "comment13": "When we were happy and we didn't know it❤\n"
  }
]