[
    {
        "gametitle": "Donkey Kong Country 2",
        "ID": "donkey-kong",
        "path": "donkey-kong",
        "songname": "Stickerbrush Symphony",
        "composername": "David Wise",
        "system": "Super Nintendo",
        "releaseyear": 1995,
        "image": "dkcTwo.png",
        "music": "stickerbush_symphony.mp3",
        "comment1": "38 years old, hanging in there. The kid who played these games is still here.",
        "comment2": "I was 13 years old. It was Christmas Eve 1995. I remember getting up around 7 am and played this game before I went to my grandma's for Christmas. It reminds me of better, simpler times.",
        "comment3": "I remember playing this game when I was a kid and my dad was dying of lung cancer. This specific level’s soundtrack touched me then and it still effects me to this day. So a work of art my heart is singing to this melody.",
        "comment4": "It reminds me of my homie Max who passed away twenty years ago. We played the game every day. Rest in Peace Max. I hope, that we will see us again on the other side.",
        "comment5": "I remember this track. This reminds me of being a kid again, I’m 35 now married with a house and puppies. Sometimes it’s scary to realize how time keeps going and doesn’t stop for anyone. I hope everyone listening to this and reading the comments grows old, happy and healthy.",
        "comment6": "Im passing through hard times rn. Divorce, my children going to live with the mother, I might comeback to my mother´s house, felling the depression symptons coming back also. Its not easy, but for some reason, when I start to listening to this song, everything gets better. It send me back on time. Just me, my SNES and happy moments. I have faith that one day things will get better",
        "comment7": "This might sound strange for some but I think the awe and nostalgic feeling this beautiful music brings forth on people actually helps coping with the inevitability of growing older and even death.\nQuoting from a wise person who once said: \"Don't be sad that it's over. Be happy that it happened.\"",
        "comment8": "This track reminds me when all i looked forward to was waiting for weekend to go blockbuster i was in middle school, i remember i would find peace playing snes being that my older brother was invovled with a street gang in los angeles during the 1990s gang murder rates were all time high! He would tell play your snes im gonna go hangout with the homeboys ill see you tomorrow, i would just start playing snes and then pray my older brother doesnt get life in prison or get murdered, All this was back in 1997. My older brother is a engineer now and he changed his life in 2003 and has 4 great intelligent kids the oldest is almost finished with college. I am also father and succesful.",
        "comment9": "Even though I didn't exist when this game was popular, this song still brings back childhood memories. :)",
        "comment10": "This song always reminds me of my dad... I was just a kid and everything was so easy. Even to ignore some feelings. Now, years after both the happy days of my childhood and the passing of someone that was so important to me as my father was, I can see that our lives are so short and that only time can make us realize some important moments that otherwise in other moment would be just...normal. I miss my father and I miss the old times...",
        "comment11": "I was 5 years old and would run into my family game room and watch my dad play and watch my brothers watching him and cheering him on and I remember only wishing I could play too instead of appreciating what I had in front of me at the time. Rip",
        "comment12": "God, I need to spend more time with my Dad...",
        "comment13": "I want my family to play this song at my funeral.",
        "comment14": "Life hurts these days, good to know I can revisit something that brought me the joy I had in my innocence. David Wise an absolute unit of a 90's composer",
        "comment15": "Been feeling really down today about my last relationship. 6 1/2 years and a promised marriage, gone. I knew in my heart he wouldn't be the man I needed. If we ever had kids he would of neglected them. This song helps me cry it out."
    },
    {
        "gametitle": "Zelda: Ocarina of Time",
        "ID": "ocarina",
        "path": "ocarina",
        "songname": "Title Theme",
        "composername": "Koji Kondo",
        "system": "Nintendo 64",
        "releaseyear": 1998,
        "image": "ocarina.png",
        "music": "ocarina_title_theme.mp3",
        "comment1": "My uncle bought my brother and I this game for Christmas 1999. I wasn’t good at it so I just enjoyed watching my brother play it almost every day after school. I don’t think he ever beat the 2 save files that he had saved, mine being the 3rd. He passed away this past spring at 29 years old, and while I don’t have the cartridge back yet I’ll be damned if I don’t finally finish this game for the two of us.",
        "comment2": "“Time passes, people move. Like a river's flow, it never ends. A childish mind will turn to noble ambition. Young love will become deep affection.”",
        "comment3": "This is the exact meaning of “Don’t cry because it’s over, smile because it happened”",
        "comment4": "Being a kid or a teenager in the late 90s was pure magic my people.",
        "comment5": "RIP brother you will be surely missed and loved forever. 1990-2022.",
        "comment6": "This song is just full of sadness and magic at the same time it makes me cry. This game is the reason why my little brother and I got into The Legend of Zelda. Reminds me of the beautiful memories that my little brother and I shared together when we were young. I miss him so much, I hope he’s happy and i hope he can forgive me for all the bad times we had. We’ve had so many good times, but they’re just at times painful to look back on. I love you so much little brother, everyday I have to wake up to silence and an empty bed. I can only find you in my memories and in our childhood video games.",
        "comment7": "I remember a few years back me and my dog were on the porch listening to this. It was just a nice little moment between the two of us . Its been three months since he was put to sleep. I miss you stryker",
        "comment8": "This song is turning everyone into a philosopher",
        "comment9": "Instantly cried when I heard this. This game blew my mind as an adolescent. Great memories.",
        "comment10": "the players will change while the game stays the same.\nthis is what listening to this timeless track makes me feel.",
        "comment11": "why does it hurt hearing this? Its such a beautiful song.",
        "comment12": "The best thing about going back to this game 24 years later? When your children ask to play this alongside you and they enjoy it just as much as you did when you were their age. That for me, completes the nostalgia I feel whenever I play these classics.",
        "comment13": "I wasn't born until 2003. But God damn this is the most nostalgic thing to me. Makes me cry almost.  This game means everything to me",
        "comment14": "This song makes me feel like I’m in a field of grass. The sun is great, the roses smell good as ever, the trees wave at me, the blue sky surrounds me, and I also see a bunny hopping it’s way to who knows. Like all my life problems just went away.",
        "comment15": "Flawless and beautiful… I never really appreciated this as a child"
    },
    {
        "gametitle": "Kingdom Hearts",
        "id": "kingdom-hearts",
        "path": "kingdom-hearts",
        "songname": "\"Dearly Beloved\"",
        "composername": "Yoko Shimomura",
        "system": "Playstation 2",
        "releaseyear": 2002,
        "image": "kingdomHrt.png",
        "music": "kh_dearlyBeloved.mp3",
        "comment1": "This song is beautiful and brings out so many elements and aspects and can be interpreted in so many ways... it just puts me at peace",
        "comment2": "To everyone in the comments. I don't know you and you don't know me but this song makes me feel feelings. Back to a simpler time it's nostalgic and the not because of the game but this puts out those emotions i feel like i'm home but i know i can't stay. I don't know you but i feel as if i do. In a way i feel as if all of you are my family one way or another. sniff I love you guys!",
        "comment3": "Wow... this came on by accident. I knew instantly what it was and it hit home. The nostalgia poured in so quick. These were the days. <3",
        "comment4": "This music will always have a special place in my heart. One time when I was a kid I turned on the game just to close my eyes and listen to this.",
        "comment5": "A picture holds a thousand words, a song holds a million memories, this games holds my childhood",
        "comment6": "I would just sit in the loading screen and listen to this song over and over as a kid. Wish I could just relive those times, playing video games with my brother and knowing what it's like to be a kid. Be care free and not have to worry about the hardships that we'll face in life... all that was on our minds was beating KH together.",
        "comment7": "Still remember that magical feel you got the first time you put in that disc in the PS2 and soon got to heard this beautiful theme for the first time ever.",
        "comment8": "I remember getting this back in 2002.  It was one of the best days of my life.  I remember staying home sick one day and then beating the game, and that song that was playing while you were watching those clips of what happened in the worlds you visited.  It brought tears to my eyes and still does.  Kingdom Hearts is the only game so far to do that to me.",
        "comment9": "I love how you can hear the waves in the background. It's so relaxing...",
        "comment10": "OMG The memories...\nEverything was better that time...",
        "comment11": "Oh God!! the Nostalgia is coming out of my eyes in the form of water! Such a melancholic and beautiful melody.",
        "comment12": "Oh man the song just gives me a wave of emotions and makes me want to remember each moment of it.",
        "comment13": "I remember playing the first game in my basement eight years ago...I was twelve...a young child with the entire world in my sights. This song brings back more than just memories of a game...it brings me back to a time where there was no need for a job, college, bills, bullshit. This game will forever be linked to my childhood. Who knew a simple tune could nearly bring a person to tears...",
        "comment14": "damn this takes me back. my cousin used to live at my house and she had this game, she would tell me not to watch her playing it because of the violence and i was so young. but when she moved out she forgot to take the game, and i played it. i got so into it, it's such a beautiful game. then, one time i played this tune on a piano for her, and was like \"remember this?\" and she was surprised. she had no idea how i knew the tune. lol",
        "comment15": "This song is my lullaby. I don't know why. It still is! ..."
    },
    {
        "gametitle": "Chrono Trigger",
        "id": "chrono-trigger",
        "path": "chrono-trigger",
        "songname": "\"Corridors of Time\"",
        "composername": "Yasunori Mitsuda",
        "system": "Super Nintendo",
        "releaseyear": 1995,
        "image": "chronoTrig.png",
        "music": "ct_corridorsOfTime.mp3",
        "comment1": "Checkpoint: Here I am, in my thirties, listening to this song again, from a game that marked a generation and that makes me think about going back in time to today! My life was one of the best, but today depression takes over, sometimes I try to recover, but not everyone around me wants peace. Someday I will come back here to write that everything worked out and that I overcame depression!",
        "comment2": "This song... The time machine that takes me back to the past its so powerful ♥️ love chrono trigger",
        "comment3": "everytime I hear this song I always remember when my little sister was still alive.. haha such good memories",
        "comment4": "This takes me back …",
        "comment5": "Don't let your bitterness cloud the beauty or hope from vision, especially if that bitterness is well earned.",
        "comment6": "My funeral song put this itch on loop!",
        "comment7": "It is a Monday.  I'm listening to a song many years older than I am. I am feeling nostalgic for a time u have yet to experience.  I feel like I was born right when everything went to shit. I'm now going to start college in a month. Amendments are being repealed,  schools are being shot up, and the world is heating up. It feels like there is no longer anything positive In this world. Sometimes it makes you want to give up, but tomorrow comes. It always does, because it must. Never give up, because it can't get worse than it is right now.",
        "comment8": "I'm 26 here in Australia drinking by myself because my life's a mess, i guess it's time to clean it up\n",
        "comment9": "Beautiful piece of music. there is a sadness in it that works as a function to portray the tragedy and state of zeal, an ideological \"utopia\" that existed at the expense of all the inhabitants below.",
        "comment10": "Rest in peace, Taia777. o7",
        "comment11": "It's a Tuesday.  I sit here writing this, feeling a sense of deja vu. College could be going better, but it could be going a lot worse. I have never cared about March in my entire life, and now it's all I look forward to. When you have some9ne to love, you change. I have never missed anyone more than my partner, and while I will see them in 11 days, it feels like a Lifetime away. \n\nNever give up",
        "comment12": "Age 29. Just had a physical and I'm over 30kg overweight; I can't drive yet so I can't be with my partner of 7 years in person; I'm working a job with limited move-up... Despite these facts, I'm going to go into this new era of my life fighting for it.",
        "comment13": "bring me to 1995!!!!\n",
        "comment14": "Checkpoint: 3/6/23. 24 years old. I first listened to this song when I was still in college. I was in a shitty relationship, I was depressed, and struggling with my classes. That was around three years ago. Today, I am so much happier. I found the right medication and therapy to treat my depression, I'm happily single, I have a good job, and a house! It's kind of lonely though, all my friends moved away post-college, I feel kind of isolated. Things aren't perfect but I never knew I could feel this light. Here's hoping things get even better next time around. ",
        "comment15": "Im a 19, soon turning 20 year old trans guy. a friend of mine pointed me to this video, saying it felt like a theme song for if life had a literal pause menu. i feel like i'm in that pause menu right now. i have adhd and depression, and i often forget to take my meds. when that happens the world turns into a timeless slog. there's a larger \"pause\" as well, i feel like i'm behind on everything- registering for college classes, getting a job, learning to drive, finding a doctor to start my transition- and i don't know how to \"unpause\". i'm afraid i'll stay stuck this way forever."
    },
    {
        "gametitle": "Katamari Damacy",
        "id": "katamari",
        "path": "katamari",
        "songname": "\"Lonely Rolling Star\"",
        "composername": "Saki Kabata",
        "system": "Playstation 2",
        "releaseyear": 2004,
        "image": "katamariD.png",
        "music": "k_lonelyRollingStar.mp3",
        "comment1": "First listened to this song durning middle school when my friend brought over Katamari one time. So touching, still makes me cry sometimes when I hear it. This song inspired me to learn Japanese. Now I’m almost 30, live in Japan, and I see all the things I used to roll up and turn into stars. Funny how life goes sometimes. I also majored Astrophysics which, come to think of it, is quite fitting.",
        "comment2": "My father showed this song to me like 3 years ago and we played katamari together after he showed me this song I'm so glad we have gotten more close together I never had someone like him he actually gives me good advice we always play games together we are closer than ever he's my only friend because I don't have any he helps me cope and things like that I love you dad :)",
        "comment3": "This game is a cherished part of my childhood...\n\nWhenever my older cousin would come over I would get really excited when we would play this together. She was a lot older than me (about a decade more), so she ended up moving away to California not too long after and I never get to see her anymore. Now, listening to this song reminds me of her. I hope she’s doing well and I can see her again some day... something about it kind of makes me want to cry. But... in a bittersweet kind of way? like a crying, but smiling, thinking of the memories way...",
        "comment4": "No one can deny it. There is a beauty to things that don't last forever. A sadness for the impermanence of things.. But a happiness to feel that we all were able to witness and experience it. To cherish those fleeting dreams.. And to appreciate them for what they were. Such is life. So.. To those out there reading this: Keep on rolling. Reach for your dreams that lay beyond the stars. No matter what happens.. It'll be okay. It will be okay.",
        "comment5": "Its a very Buddhist theme of balance. Its like we want be with people we love some times. That's sad. But the best thing will always be to let go and wish them the best. Yes its lonely, but it doesn't mean we can't be happy. \n\nJust like a song can be deep but also just a fun song on a video game.",
        "comment6": "This song is about two lovers. The singer is singing about how it's in her lover's nature to roll and wander around, and eventually apart from her. She accepts this and waits for her lover, because she knows that her lover will always\r\n\r\neventually\r\n\r\ncome\r\n\r\nrolling\r\n\r\nback\r\n\r\nto her.",
        "comment7": "I have never played this game... but I still have nostalgia for it. Through the music alone.\n",
        "comment8": "This is strangely calming, it's not happy but it's not sad... It's simply serene.....\n",
        "comment9": "I always loved this song from the original Katamari game I grew up playing with my father and sister. Recently I moved overseas to properly start my solo life far from home... And now re-listening to it and re-discovering the lyrics, I just can't help but calling them and catching up with them.\n\nThe lyrics \"Now, face forward and go\" (Saa, Mae wo muite ikou),  \"Don't give up, alright?\" (Akiramenaideyo, ne?) and \"Gimme a call sometimes\"(Tama ni wa denwa shite) especially pull on the heart strings.",
        "comment10": "Me and my best friend went half and half on this game on release without knowing what it was. This song has stuck with me for over half my life.\n",
        "comment11": "I’m listen to this when I’m on the verge of losing it.\n",
        "comment12": "I'm is aware that I need to let her go but a little part of me is still attached to the idea of her someday returning... I truly believe that life is just about rolling with people but always be aware that at the end of the day you need to roll things alone, so you are constantly a Lonely Rolling Star... It's been really difficult for me to overcome this broken heart, but until the next person arrives, ill be rolling by myself :)",
        "comment13": "I’ll never forget the day when I first sat down to play Katamari and this song came on. It was the first time I went and bought an actual sound track to a video game. Damn, that was like 13 years ago...\n",
        "comment14": "this song is carrying me through my depression.\n",
        "comment15": "I find it amazing how everyone is expressing their thoughts and feeling on this song in the comments. Despite most having a language barrier, we all felt the same feeling together just by listening to the song and how the singer expressed this bittersweet tone that I think it’s hard to even expressed just in speaking. Shows you how powerful music is and how no matter what language you speak, music will touch you all in the same"
    },
    {
        "gametitle": "Animal Crossing: Wild World",
        "id": "animal-crossing",
        "path": "animal-crossing",
        "songname": "\"Title Screen\"",
        "composername": "Kazumi Totaka",
        "system": "Nintendo DS",
        "releaseyear": 2005,
        "image": "acWW.png",
        "music": "acww_titleScreen.mp3",
        "comment1": "I just didn’t expect a wave of nostalgia flowing over me, and yes I’m crying\n",
        "comment2": "Omg I used to just leave my DS on the title screen and listen to this and the little voice that said “nintendo” was my fav. ♥ glad I was able to come back to it years and years later ♥",
        "comment3": "Nostalgia floats with me this quiet and calm night. A song of my youth plays its familiar tune. Cold wind sweeps by. A lovely night indeed.\n",
        "comment4": "I still fondly remember the summer nights I stayed up late at night playing games like this and Pokémon platinum. I miss those times\n",
        "comment5": "I remember listening to this song with my ex fiancee one night before I had to go away to another country for months. We hugged on the floor of our room and just cried together while we listened to the songs that helped her fall asleep at night. This song will always be magical to me and will always remind me of that ",
        "comment6": "These are the feelings I want to live for, these are what we stay alive for. \nI want to create and help make more people feel like this because, to me, there are not many things as beautiful\n",
        "comment7": "when i hear this song then i feel like LIFE IS WONDERFUL!\nAWESOME\n",
        "comment8": "Actually Best game music in existence. This is beautiful! :'( This song hurts my heart more then having a fricking heart attack! This is the best...\nI miss my old friends.... Goodbye ",
        "comment9": "Makes me feel happy, I’ll come back here someday...\n",
        "comment10": "My heart, I CANT TAKE THESE FEELS IM FEELING\n",
        "comment11": "This makes me miss those endless summers playing wild world with my friends. I miss my town. I can't even remember what I called it. It's long gone now",
        "comment12": "Summer, window open, sound of birds and car-alarms in the distance... Sitting inside on the small crt tv palying this game... Damn the memories are so fresh when I listen to this",
        "comment13": "When we were happy and we didn't know it❤\n",
        "comment14": "I was expecting the comments to be \"this is so relaxing\" but I wasn't expecting to see people talk about death.\n",
        "comment15": "Life isn’t easy and I swear it’s only getting harder when one door opens a few more close. It breaks me down, I’m stronger than this but I don’t know How much more I can take.\n"
    },
    {
        "gametitle": "Shenmu",
        "id": "shenmu",
        "path": "shenmu",
        "songname": "\"Nightfall\"",
        "composername": "Takenobu Mitsuyoshi",
        "system": "Sega Dreamcast",
        "releaseyear": 1999,
        "image": "shenmu.png",
        "music": "shen_nightFalls.mp3",
        "comment1": "This song brings warm, yet faintly bittersweet nostalgia. My late Dad (since last year) bought me this game when I got my Dreamcast for Christmas. Thank you so much Dad.\n\n",
        "comment2": "Damn...this song hits hard on my feelings. Shenmue is truly a life-changing experience that all those who played it are lucky to have had that chance",
        "comment3": "I would like to hear this in real life every time the sun sets.\n\n",
        "comment4": "This music brings me back to those 2004's summer evenings in Nanning, China when I finished my shift and went to working class food stalls to eat alone, then walked back to my apartment, gazed at the developing city's panorama and smoked for a bit, then went to sleep, alone.\n",
        "comment5": "Didn’t play it on the Dreamcast but the remastered version on my Xbox One through the summer of 2019 at age 16. I want to go back to those summer nights playing this game. It gave me a great sense of nostalgia I thought I’d never want to come back to. ❤\n\n",
        "comment6": "playing shenmue was best experience in my life i will never forget how this game felt\n",
        "comment7": "Ah man those were the golden days.\n",
        "comment8": "Reminds me of my youth, very nostalgic\n",
        "comment9": "If I could go back in time and visit myself in the year 2000. I'd tell the kid that this game would be one of highlights of his life and that it would stay with him forever.\n",
        "comment10": "I was outside and it started getting dark and a street corner light turned on and this song popped into my head. So perfect.\n",
        "comment11": "I regret so much having wasted my childhood and teenage years playing WoW. I feel i missed so many good games.                                       Somethings I could never experience again.\n",
        "comment12": "How the heck am I getting nostalgia from a game I've legit never played?\n",
        "comment13": "I'VE BEEN SEARCHING FOR THIS TRACK FOR 2 1/2 YEARS NOW!!!!\n",
        "comment14": "This holds so many memories forever fan\n",
        "comment15": "Life isn’t easy and I swear it’s only getting harder when one door opens a few more close. It breaks me down, I’m stronger than this but I don’t know How much more I can take.\n"
    },
    {
        "gametitle": "Super Smash Bros: Brawl",
        "id": "brawl",
        "path": "brawl",
        "songname": "\"Trophy Gallery\"",
        "composername": "Nobuo Uematsu",
        "system": "Nintendo Wii",
        "releaseyear": 2008,
        "image": "ssmb.png",
        "music": "ssmb_trophyGallery.mp3",
        "comment1": "I remember one day just sitting down in front of the tv on top of the table and checking through what I had in the trophy gallery, that was such a fun time. I spent like hours there, it's an experience I can't have again but I'm glad I had it then\n",
        "comment2": "I've most likely heard this for multiple hours a day as a kid\n",
        "comment3": "I remember back then, coming home from middle school, getting a plate of food from my momma, turning on the wii launching up brawl to play this song, and draw or study \nThe good ol days, makes me sad and happy",
        "comment4": "I remember as a kid I played a lot of video games on the Wii and GameCube but it really took me a long time to realize how hard the music slapped back then. I wish I could enjoy those days when I didn't have to worry about things like the Pythagorean theorem, macroeconomics, biology, literature and philosophy and German and just embrace the times I spent playing Brawl and other games on Wii remote and nunchuck sitting behind my older brothers on stools in our room as I get destroyed and still loved that time.\nAlthough sounding corny, now I'm just a sad and empty vessel of what I was.",
        "comment5": "“Don’t cry because it’s over. Smile because it happened.”",
        "comment6": "forgot what this song was called. looking up \"smash bros elevator music\" immediately popped it up. godspeed\n",
        "comment7": "You're 9 years old, Brawl has been out for a month or two now and you've acquired a bunch of trophies over that time. Friday comes, you get home from school, and immediately run to power on your Nintendo Wii and boot up Brawl. You head to the trophy gallery and admire the ones you've unlocked so far, reading some of the descriptions with this tune playing in the background. You can smell dinner being prepared in the kitchen as time gets away from you and the sun starts to set. Life is good, and you stop for a moment to appreciate just how beautiful the simplest things can be.\n",
        "comment8": "This hits hard tbh.\nCan't believe it's been so long since SSBB released. God, I miss those days.",
        "comment9": "So peaceful , nostalgic and it sounds just like some elevator music\n",
        "comment10": "Takes me back to Spring 2010 when I was in 7th grade. it was Spring Break and I had the windows open in my room and I’d be on this screen in the game\n",
        "comment11": "I kind of want to cry, it's so nostalgic\n",
        "comment12": "Immediately takes me back to being 11 years old. Miss it.\n\n",
        "comment13": "This takes me back to when I was a young kid excited to wake up and play on the Wii. Man, the emotions I feel.\n",
        "comment14": "We've been expecting you. You've been searching for a place to rest and tho it's not forever please enjoy this temporary sonic oasis\n",
        "comment15": "if i ever get a nice date, i'll put this as background music while we have dinner lol\n"
    },
    {
        "gametitle": "Yoshis Island",
        "id": "yoshi",
        "path": "yoshi",
        "songname": "\"Flower Garden\"",
        "composername": "Koji Kondo",
        "system": "Super Nintendo",
        "releaseyear": 1995,
        "image": "yoshi.png",
        "music": "yoshi_flowerGarden.mp3",
        "comment1": "How can a song make me time travel like that?\nIt sounds like childhood ",
        "comment2": "I was born in 1982...  It makes me go back to my childhood.\nNow i am 40 years old.... Time flyes so fast. I might be neurosurgeon but that child is still here.",
        "comment3": "I remember my older brother had this game, i always wanted to play it but it became forgotten by me and my big bro. And when i heard this music all the memories came back in a flash now i wanna play it even more. This music makes me happy all the time cause it brings back memories of the good ol' days.\n",
        "comment4": " whistle this all day when its sunny outside. Some people recognize where its from and wave at me with a smile :D Best game ever",
        "comment5": "Well the games now a days, don't have the same kind of feel as they used to.  A game like this you can play through over and over, come back to it 10 years later, and a play through will still be magical.  While now a days, while games are still good, it's all visual.  Where fun factor isn't really the main focus now as much as wowing the player with freaking awesome visuals.  Different types of magic.\n",
        "comment6": "I hear this and feel myself excited to get home from kindergarten so I can play this game. This song defines nostalgia.\n",
        "comment7": "Dude...that feeling...\n",
        "comment8": "Growing up as a kid playing this game, it lowkey has one of my favorite soundtracks of all time.  Idk how to explain the nostalgia I feel from it, brings me back to my childhood instantly\n",
        "comment9": "OLD DAYS <3 MAKES ME THINK ABOUT MY CHILDHOOD WHEN I PLAYED THIS WITH MY GRANDMOTHER <3 <3\n",
        "comment10": "Kid of the 80s... Man how i miss that time. Life was so simple\n",
        "comment11": "My brother love this game because Yoshi is his favorite character and like this is one of the best I played as a kid when I first encounter this. To this day, me and my brotber still played this game.\n",
        "comment12": "My dog is named yoshi! Lol this makes me smile every time I listen to it.\n",
        "comment13": "This heartwarming theme makes me forget about that crying baby...\n\n",
        "comment14": "I just feel so happy and safe\n",
        "comment15": "This make me happy and cry at the same time\n"
    },
    {
        "gametitle": "Silent Hill 2",
        "id": "silent-hill",
        "path": "silent-hill",
        "songname": "\"Laura\"",
        "composername": "Akira Yamaoka",
        "system": "Playstation 2",
        "releaseyear": 2001,
        "image": "silentHill.png",
        "music": "sh_lauraTheme.mp3",
        "comment1": "Promise was my \"walk down the aisle\" song at my wedding. His first words of his proposal were \"in my restless dreams, I see your face\" My husband and i just had a baby girl and named our daughter Alessa after silent hill. The entire sound track is phenomenal. Still makes me cry\n",
        "comment2": "Will you love me? Take care of me? Heal all my pain?\n\nThat's what I thought.",
        "comment3": "Music has such an impact on us and it's almost unbelievable what a song can make us do. It can make us grow up, act childish, change our ways, for the good or the bad...",
        "comment4": "I feel like I'm all alone when I listen to it. So beautiful and deep.\n",
        "comment5": "man this song is just so beautiful...it makes everything so calm, yet sad....\r\nAkira is a great person and makes masterpices..",
        "comment6": "I love this tune so damn much, the feels it brings just makes one feel alive!!!\n",
        "comment7": "\"It's hot as hell in here...\" \n\"You see it too? For me, it's always like this.\"",
        "comment8": "this song gives a lot of emotion into you, like when the violin plays in it brings you to a great depression-sad moment but then it stops for a time and the music box plays in and it sounds like hope but then it vanishes and the sad violin comes again.\n",
        "comment9": "when i hear the piano strokes of this song, i think of all the mistakes i made in the past...When i see the flames, They prevent me from going back to correct  my mistakes..Maybe this is why some memories hurt when they are remembered. \n",
        "comment10": "It reminds u of happy,sad,depressing,undescribed emotions as well as...letting it take the full affect on you...and make u think of things that remind you of what this song brings to us...Beautiful song",
        "comment11": "Really like this track, mainly for it helps me vent out my tears whenever I'm sad.\n",
        "comment12": "R.I.P to the one who introduced me this legendary game\n",
        "comment13": "A part of me deep in my soul has always felt a strong connection to this song and that fiery staircase.. I'm a melancholy and I sometimes feel truly at home in those lonely sad places..\n",
        "comment14": "You have no hope and you have nothing but hope. Perhaps, once in a world far away from here you were tired and this is your rest. A thought comes into your head. Go back down stairs. But they'll never lead you anywhere but hell.",
        "comment15": "when i hear this song...i feel kinda lonley but very happy...relaxed...and as if im in the most beautfil place on earth....and i just want to stay there....laying....."
    },
    {
        "gametitle": "Pokemon Crystal",
        "id": "pkm-crystal",
        "path": "pkm-crystal",
        "songname": "\"National Park\"",
        "composername": "Junichi Masuda",
        "system": "Gameboy Color",
        "releaseyear": 2000,
        "image": "crystal.png",
        "music": "crystal_nationalPark.mp3",
        "comment1": "I'm 28 now. I remember coming onto this video when I was about 18 and going through the struggles of coming of age, remembering being eight years old and playing Pokemon. I wasn't ready to accept that it was part of a bygone era of my childhood. Ten years passed then, ten years have passed again. That struggle seems so far away now, and adulthood doesn't hurt like it did when I was going through those growing pains. \r\nNever forget that feeling of being a child and discovering things for the first time. There's so much more to life you ",
        "comment2": "I was only 17, trying to relive a time where I could feel happiness while in a raging war against depression, a fight that would ultimately lead me to try and take my own life in my high school bathroom. My life wasn't horrible, but I was in an abusive relationship, my grades kept slipping, and I felt like I was drowning in emotions I couldn't understand, as I struggle to grasp the mental conditions that forced their way up as I grew. The song wasn't the same, but the comfort was still there. And I would retreat to the original Gold just to hear the song that made me feel peace as a little kid.\n\nI am now 28. I am nowhere near where I hoped I'd be as an adult, but I still have things I never thought I'd have when I was 17. A wife, a condo I just bought, and my first kid on his way. Even at 28 I'm still terrified of what life will be like, and how much more I'll have to grow as an adult to provide for my family. But I hear this song, and 20 years later, the peace still remains.",
        "comment3": "Reading the comments while this music plays in the background really hits me in the feels\n",
        "comment4": "im 29 now and had a deep cry today remembering my grandma who passed from covid. she brought me my first gameboy color and gold version for my 8th birthday.",
        "comment5": "The past may be forever gone, but it lives through the memories we will never forget.\n",
        "comment6": "im just a 13 year old kid, my life is sad most of the time, and i know people have it way harder then me. ive been bullied alot and im a social outcast, i only have two friends and one of them is popular. and despite all of this, when i listen at this music for a RPG game meant for 10 year olds, i feel complete and better. i think about how middle school drama doesnt matter in my future life. i should just live my life to the fullest, and be a good person. this music made me cry\n",
        "comment7": "Wow, am I an adult already? \n\nIt feels like yesterday that I got my Gameboy Advanced and only had Pokemon Gold and Red. This music subconsciously brings a tear to my eyes. Time sure flies, huh? \n\nI miss being a kid, man. It was so much simpler...",
        "comment8": "As an adult at 29 years.\nThis hit's me as the ten year old boy i was.\n\nYou may call it stupid.\nBut never forget what kind of music that hit you when you where young.\nIt will never fade away.\nNever  forget what you where as a child.\n\nNintendo will always make you as the child youy where.\nIt will never  leave you, so the way you want to forget it.",
        "comment9": "I used to just go to the park in real life, go to National Park in the game & then sit there & look up at the sky\n",
        "comment10": "this will absolutely be one of the songs on my funeral playlist.  it's been in my head since i was like 6, it seems fitting.\n",
        "comment11": "For those scared of time itself and growing up, progression never dies, we can always hold onto the past.\n",
        "comment12": "I remember first hearing this song on a cool night, eating pizza in a hotel by the beach with my family. We took those nights for granted. Now here I am, almost 20 years later, thinking back to nights like those and wishing I could experience them all over again.\n",
        "comment13": "I'm a kid here and reading all of these comments of older adults listening and playing Pokemon gold when they were children. It sounds so heartwarming, and the way that the music has so much feeling to it... its just so sweet how a certain audio can make people remember good memories <3\n\n",
        "comment14": "Beautiful music and memories. Don't let it die, play them again, relive this moment with the adult consciousness. I'm 29, teach martial arts, and every year I play an old pokemon game during summer holidays. This year is Crystal time.",
        "comment15": "I am passing through a stressful part of my life, specially at work. I really miss the good old days when I was a kid and my only worry was school, I was happy and I didn't know it...\nBut even if I had the chance, I wouldn't go back to the past. I'm glad that my childhood happened. And that's the magic behind childhood, not living it, but remembering.\nNostalgia is such a deep feeling."
    },
    {
        "gametitle": "Donkey Kong Country 1",
        "id": "donkey-kong-country1",
        "path": "donkey-kong-country1",
        "songname": "\"Aquatic Ambieance\"",
        "composername": "David Wise",
        "system": "Super Nintendo",
        "releaseyear": 1994,
        "image": "dkc1.png",
        "music": "dkc1_aquaticAmbience.mp3",
        "comment1": "This song has so much meaning to me. The memories of me and my mom playing this game together, over and over. One of the very few games she enjoyed.\nSadly she passed away when I was 18. We had like a \"funeral party\", and I had to chose a song that plays when all of us walked into the church. It was this song that I chose, an emotional roller coaster. I don't even know why I'm typing this in a Youtube comment section. \n\n\nAnyways, regardless of my story, this is a beautiful song.",
        "comment2": "This was my cousin's favorite trippy song. I just came back from his funeral. May you rest in peace Vitor, I love you and will carry you with me for all my life\n",
        "comment3": "I don’t think people truly understand the chokehold nostalgia can have on a person. Sounds, music, smells, foods. It all just transports us back to happier, simpler times. And this song does it.\n",
        "comment4": "Threw some waterproof earbuds on and a snorkel and went down to the river and swam around with this music\n",
        "comment5": "I'm on a 5g mushroom trip rn after a heavy breakup. And I'm crying. I'm a 27 year old man. This song is a glimpse into heaven. Shout out to my grandma",
        "comment6": "\"Yea just make a song that makes you feel like your underwater, don't go to crazy\"\n\n*creates song that makes you feel like your witnessing the heat death of the universe",
        "comment7": "Why does this song hit so emotionally? Brings me back to a time where I was just chilling with friends with zero worries. I feel like no one older wants to admit life never gets better than those moments.\n",
        "comment8": "The nostalgia has me crying, many nights sleeping over at my friends house playing DKC, Contra and Star Fox, best times of my life.",
        "comment9": "The beginning of this makes me feel so amazing ! And then so lonely like I’m longing for something , great composer yes it’s video game music ,but this is truly special time for me and this brings it back for a second\n",
        "comment10": "Use to play this with my dad when I was a kid. This song in particular was always our favorite. My father has since passed away to colon cancer and I listen to this all the time. It reminds me of him, and the times we sat on the edge of my bed just playing DKC. I miss you dad",
        "comment11": "It's actually very comforting reading all these comments...knowing that this song makes others feel the same. Really makes me long to be a child again, when things were much simpler.\n\n",
        "comment12": "I listen to this probably 5 times a week at least\n",
        "comment13": "this makes me feel like 15 different emotions at once\n",
        "comment14": "The feeling of being 12 getting home from school, opening a window to feel the cool air of fall and sitting down to play some Donkey Kong Country.\nGood times man, good times.",
        "comment15": "I listen to this song and it’s like I’m with my brother again, until we meet again on the other side Bobby, I’ll be here reminiscing our pure bliss of playing DKC together."
    },
    {
        "gametitle": "Sonic Adventure",
        "id": "sonic-adv",
        "path": "sonic-adv",
        "songname": "\"Station Square\"",
        "composername": "Jun Senoue",
        "system": "Sega Dreamcast",
        "releaseyear": 1998,
        "image": "sonicAdv.png",
        "music": "sonicA_stationSq.mp3",
        "comment1": "I remember running down to recess with my hands behind my back like sonic. This music is childhood\n",
        "comment2": "Rest in Peace to Kris King!! My Cousin, my little brother and everyone best friend, didn't make it to 21!!! We grew up playing sonic, I can't believe you're gone....\n",
        "comment3": "This is part of the soundtrack of my life. This was one of my  first 3 videogames we got that fateful Christmas and my sister and I have played eversince. Makes me proud to know that this was what I left my dear sonic loving friend with on his birthday. I haven't seen him in years... but this song reminds me that I won't be soon forgotten :)\n",
        "comment4": "awwwwww my precious childhood\n",
        "comment5": "This game got me through a lot of family problems growing up, and I didn't mind being stuck in station square since I always had this kickass song playing\n",
        "comment6": "i really, really wish i could play this and the sequel again for the first time. out of all games ive played in my life, these two and the music have stuck as an all time favorite for me. hardcore nostalgia everytime i listen to it and it sends me back.\n",
        "comment7": "Right in the nostalgia :'D had so much fun with this game back then and still do today :D\n",
        "comment8": "I remember back in the day it was 1999 I was 11 I used to play this game all day what memories man...\n",
        "comment9": "I never thought nostalgia for this game would hit me so hard\n",
        "comment10": "Even if i was born in 2008 i was still always in love with the first 3D Sonic game\n",
        "comment11": "Fuck man. If I could just go back to ten years ago and relive the days when I used to play games like this that would be a dream come true.\n",
        "comment12": "99% if comments: so nostalgic \nme: Korg Trinity sounds so good",
        "comment13": "I get sad everytime I hear this bro cause this shit takes me back to when I was a kid, Livin care free and playin Sega Dreamcast all day with my dad, miss them days man\n",
        "comment14": "This also remind me days that I have with my uncle \nHe lost in 2011\nThanks to him this piece of music is my childhood and it never change",
        "comment15": "Ahhh too much nostalgia haha. Used to love playing this with my Grandma! I haven't heard this song in years and I just felt I was in the early 2000's again"
    },
    {
        "gametitle": "Super Mario 64",
        "id": "mario-six-four",
        "path": "mario-six-four",
        "songname": "\"Dire Docks\"",
        "composername": "Koji Kondo",
        "system": "Nintendo 64",
        "releaseyear": 1996,
        "image": "marioSixFour.png",
        "music": "mario64_direDocks.mp3",
        "comment1": "Fun fact: I used to play this late at night and fall asleep listening to this calming tune.\nSeveral years later, I used it to put my daughters to sleep when they were babies.",
        "comment2": "I’m 34 and crying as I listen . Takes me back to simpler times as a kid , just chilling with my brother not a care in the world .\n",
        "comment3": "To me, I can relate to that feeling of loneliness, I think we all can, from one point in our lives or another. Through the venture of life, we feel often feel alone, tackling those obstacles by ourselves as time moves on. Super Mario 64's narrative captures that venture, and in a sense this crazy world we play in seems more real to us than we could have imagined.\n\nPersonally, I think this theme epitomises that feeling of loneliness, and adventuring through life alone, and rather perfectly at that.",
        "comment4": "hearing this makes me want to be a little kid again. no stress, just me my best buds and my n64. good times, I miss the 90s.\n",
        "comment5": "It makes me want to cry when I hear this beautiful theme. I miss my sister. 07/10/1973 - 06/012020",
        "comment6": "Time slips out of our hands. People change. Brands come and go. Companies go bankrupt. Technology advances. Consoles die. Fandoms peter out. Memories fade. \n",
        "comment7": "I cannot not cry when I hear this… I played this game in 90s, I’m 30 years old and today I can say this is the best game I ever played, the water level, the ship, bowser, metal level (when you could have metal mario don’t remember the name) snow level, mushroom level, the painting, et the sky level, going up and exploring the mansion, being scared of the infinite stair (because you didn’t unlock it) with the sound, wooooow , writing this seriously… also at this time my grandmother was still Alive, seriously it’s just a beautiful game\n\n",
        "comment8": "I wanna be in 1990s so bad. Children looks so innocent and happy. We all acted our ages.\n",
        "comment9": "This music always brings tears to my eyes... \nMy ex girlfriend played this music on the piano and I was sitting next to her listening to her playing…\nI could spend hours listening to it so much I found it beautiful…\nSome time she stopped and looked at me with a beautiful smile... \nBut she had to go to Japan to continue her studies... \nShe told me that she was finally going to live there since this is the better for her and realize her dreams... \nI will surely never see her again but this music always brings me back memories so good and sweet... \nThank you for reading this comment ^^",
        "comment10": "This song feels comforting yet moody...just like this longing for the warmth & wonder of your childhood that is just out of reach. Longing for a world different than you had imagined. Just makes me appreciate the sacrifice my family made for me to have these memories.\n",
        "comment11": "This is cheesy as hell, but after I tried to take my life as a teen, all I could remember was this. The freedom I felt when listening as a child. The curiosity it sparked within me. The pure joy it brought me. I told myself I want to feel like that more. If I hadn't have has this as a child, I don't know if I could have found the hope to continue.\n",
        "comment12": "I still see myself as a kid sitting on the bare ground, playing this fantastic game on some chunky, square TV. This soundtrack always triggers a bittersweet,  calming nostalgia!\n",
        "comment13": "every time i hear this im instantly transported back to playing mario 64 as a kid. its a warm blanket. this song is the 90's. its beautiful.\n",
        "comment14": "This music in particular always helped me when is difficult to sleep, so i start to sing mentally this beatiful melody, it`s so peaceful, gentle, like i am diving deeper in  waters to a safer, comfortable  place. Koji Kondo made unforgettable compositions to game`s universe.\n",
        "comment15": "These songs strike my memory and imagination of my child years. In that background sky on the cover of the game i like to believe that sky connects to the same sky I looked at when I was a kid. Its like a real world back in that time. This music brings back the sense of being in that same world again after all the years. Nostalgia is a very powerful feeling. \n"
    },
    {
        "gametitle": "Minecraft",
        "id": "minecraft",
        "path": "minecraft",
        "songname": "\"Subwoofer Lullaby\"",
        "composername": "C418",
        "system": "PC",
        "releaseyear": 2009,
        "image": "minecraft.png",
        "music": "minecraft_subwooferLullaby.mp3",
        "comment1": "This sounds like someone who's life's fading away and they're seeing the happiest moments of their lives\n",
        "comment2": "This song always makes me think back to late 2009, when my dad and I would play in the tutorial world of minecraft 360 every day after school. Slowly learning the controlls and being mesmerised by such an amazing game, and most importantly bonding and having so much fun with my father. I miss those days, and I miss my dad. I love you dad, I'll see you again on the other side.\n",
        "comment3": "its 3:39 am. im feeling the cool breeze from my fan as i watch the little apartments nearby with my dim computer screen to just barely see my room. it's so calm. i haven't felt this- or anything- in awhile. i... think life is getting better now.\n",
        "comment4": "Just a year back I saw Nostalgia as a happy thing, calming me down in bad moods. But going through bad times, Nostalgia is different, it really hurts, terribly. These days when I see anything Nostalgic I get a feeling of absolute sorrow in my stomach. But at the same time, the feeling is so addictive, that's why I'm here. The past needs to eventually be left behind, but in times like this, it's just so hard to do that. I will never forget my history, especially with this game.\n",
        "comment5": "\"I can't cry because of a videogame!\"\nMinecraft: Eee oo eee\nMe: Tears",
        "comment6": "this is my first time crying in a while, I didn’t think I would, this song means so much to me it’s my favorite out of all Minecraft songs I would always get happy when it started playing, I cant believe how fast time flies, it’s crazy, I miss the old days, I miss it all, it hurts to know I’ll never go back.\n",
        "comment7": "This may be a little odd but to me this sounds like our worlds waiting. Not like a brand new one, but the ones we spent hours with. It sounds like them telling us that no matter how life changes us, we’ll still have some memories there and it’ll always be there to make some more or just be a little refuge for a while.\n",
        "comment8": "Thank you, for creating what is probably the most recognizable music ever. You fill my mind with the good, the bad and the ugly memories, Nostalgia and love for my favourite game. I cant imagine myself listening to anything other than your music when i play minecraft. You created such a mastermind sound track it hasnt changed in almost 10 years.minecraft just wouldnt be the same without your music and i cant thank you enough for the lifetime of pleasant memories listening to your music.\n",
        "comment9": "This man's music is incomparable. I used to have a world with my little brother back in 2015 and we used to play all the time. Now I'm 15 and listening to this makes me cry in nostalgia and memories come back flooding.\n",
        "comment10": "Listening to this song while the world is just falling apart, it kills me.",
        "comment11": "\"We didn't know we were making memories, we just knew we were having fun\"",
        "comment12": "Nobody knows pain until you listen to this and get nostalgic like I’m calm but I feel like I’m being stabbed in the heart\n",
        "comment13": "This soundtrack: exist\n\nEveryone in this comment section: becomes Plato, Shakespeare, Tolkien",
        "comment14": "As life today is not as good as it used to be we can just listen to this song and just remember the good times and just smile that we are alive and still breathing and realize the fact that we the people can remember that we’ve experienced the bad things that life has thrown at us but we can always just.....\n\nRemember that we’re still here....",
        "comment15": "when the world ends, let’s save 3 minutes and 29 seconds just to hear this. please.\n"
    },
    {
        "gametitle": "Earthbound",
        "id": "earthbound",
        "path": "earthbound",
        "songname": "\"Home Sweet Home\"",
        "composername": "Keiichi Suzuki",
        "system": "Super Nintendo",
        "releaseyear": 1994,
        "image": "earthbound.png",
        "music": "earthbound_homeSweetHome.mp3",
        "comment1": "I had a best friend who passed away a few months ago. We dreamed of making music together alongside another best friend of ours, Luis was a one of a kind and was more than a friend. He was our brother in arms, everyday I think of this man and the dream we shared together. I hope to make them come true so he can live on. I miss you Luis come visit sometime in magicant with me it'll be fun\n",
        "comment2": "This song made me want to call my parents and see how they are doing... and I did... They are fine. :)\n",
        "comment3": "This song really gets to me. It makes me feel something I havent felt in a long time: childhood innocence. It reminds me of coming home from a long summer day, my mom is waiting for me at the table with dinner, and waiting to clean off the dirt on my face from playing outside, and a smile on her face. It was those moments where nothing could ever go wrong in such a corrupt world, and that's what Earthbound shows amazingly.\n",
        "comment4": "I come here during the hard and not so hard times. It reminds me of childhood, not a care in the world. Going to sleep excited for the next day. Finding out about all the wonders of the world. Playing video games and playing the absolute joy that is Earthbound. Believing. Believing in Santa, in people, believing in fairy tales and lucky charms and... believing in the world. Times like these seem far-gone now, but atleast we have the memories of these things. January 7th, 2022, at 5:30 PM, EST",
        "comment5": "I don't know why.. but this song makes me think about life. About all the happy and sad moments.. and whatever you do, life goes on and you will never be able to turn back time. This song gives me so many mixed feelings, and how I wish I was able to go back in time.\n",
        "comment6": "2 days ago my older passed from alcohol poisoning and I've been listening to this on repeat.. I don't understand the world and hate everything but this music is truly beautiful.. earthbound... geezus\n",
        "comment7": "Times constantly changing, new things being invented. Atleast we still have the past to hold onto, the simpler times, and we have the future to look forward to aswell, whether near or far. I hope I can accomplish my dreams of being an indie developer one day, who knows how long it'll take before I'll make it, maybe I'll never make it, and that's okay. ",
        "comment8": "just visited my parents a month after moving out, this was in my head the whole time... I almost teared up once I left and listened to this\n",
        "comment9": "This brings tears to my eyes. It reminds me of when I was still a young man, and when I had to leave home to pursue my destiny in the real world. My mother gave me my dad's number and I decided to call him. He spoke words of wisdom: \"I don't think it's good to work too hard.\"\r\nI finished my call with him and gave my Mother and Sister another sad goodbye, and I was off.",
        "comment10": "Driving to and back from the cemetery while listening to this....yeah I almost teared :.)\n\n",
        "comment11": "I miss my childhood. 30 years is a long time.\n",
        "comment12": "I... have never heard a song that made me cry so much, wow\n",
        "comment13": "This song reminds me of my friend. I moved to a different state after highschool and I really didn't like it there, but after meeting her, it's like a new home to me\n",
        "comment14": "this song makes me feel very bittersweet. I don’t have the best family, and i don’t have very many friends, but all those little moments with them really mean a lot to me, it’s so sweet to think there’s people who truly love me, despite not understanding me any better than i do. God, i love this game and it’s soundtrack.\n",
        "comment15": "I believe in skies forever blue\nwhy shouldn't I believe the same in you?"
    },
    {
        "gametitle": "Kirby's Adventure",
        "id": "kirby",
        "path": "kirby",
        "songname": "\"Butter Building\"",
        "composername": "Hirozaku Ando",
        "system": "Nintendo Entertainment System",
        "releaseyear": 1993,
        "image": "kirbysA.png",
        "music": "kirbyA_butterBuilding.mp3",
        "comment1": "I don't need therapy, I need this :)",
        "comment2": "im crying! :'( all my childhood and memories of my friends playing with this game . thanks for uploading!! i got my nintendo classic mini today!! yay!",
        "comment3": "No one can deny it. There is a beauty to things that don't last forever. A sadness for the impermanence of things.. But a happiness to feel that we all were able to witness and experience it. To cherish those fleeting dreams.. And to appreciate them for what they were. Such is life. So.. To those out there reading this: Keep on rolling. Reach for your dreams that lay beyond the stars. No matter what happens.. It'll be okay. It will be okay.",
        "comment4": "I wasn't even around until the 2000s and yet this brings back such memories ❤ my sister and I love this game",
        "comment5": "\"Me and my best friend went half and half on this game on release without knowing what it was. This song has stuck with me for over half my life.\n\"",
        "comment6": "I was 13 years old. It was Christmas Eve 1995. I remember getting up around 7 am and played this game before I went to my grandma's for Christmas. It reminds me of better, simpler times.",
        "comment7": "Rest in peace, Taia777. o7",
        "comment8": "Growing up as a kid playing this game, it lowkey has one of my favorite soundtracks of all time.  Idk how to explain the nostalgia I feel from it, brings me back to my childhood instantly\n",
        "comment9": "Why does this song hit so emotionally? Brings me back to a time where I was just chilling with friends with zero worries. I feel like no one older wants to admit life never gets better than those moments.\n",
        "comment10": "This is cheesy as hell, but after I tried to take my life as a teen, all I could remember was this. The freedom I felt when listening as a child. The curiosity it sparked within me. The pure joy it brought me. I told myself I want to feel like that more. If I hadn't have has this as a child, I don't know if I could have found the hope to continue.\n",
        "comment11": "Fuck man. If I could just go back to ten years ago and relive the days when I used to play games like this that would be a dream come true.\n",
        "comment12": "Beautiful music and memories. Don't let it die, play them again, relive this moment with the adult consciousness. I'm 29, teach martial arts, and every year I play an old pokemon game during summer holidays. This year is Crystal time.",
        "comment13": "Kid of the 80s... Man how i miss that time. Life was so simple\n",
        "comment14": " whistle this all day when its sunny outside. Some people recognize where its from and wave at me with a smile :D Best game ever",
        "comment15": "Ahhh too much nostalgia haha. Used to love playing this with my Grandma! I haven't heard this song in years and I just felt I was in the early 2000's again"
    },
    {
        "gametitle": "Zelda: Majoras Mask",
        "id": "majoras-mask",
        "path": "majoras-mask",
        "songname": "\"Song of Healing\"",
        "composername": "Koji Kondo",
        "system": "Nintendo 64",
        "releaseyear": 2000,
        "image": "majorasMask.png",
        "music": "majoras_songOfHealing.mp3",
        "comment1": "The best part about this song is that it can change depending on what stage of life you’re in. If you’re happy with your life and are living to it’s fullest it can sound depressing and hopeless, but if you are in a position where you feel hopeless or detached from your life it can sound soothing, and can put you back to a moment you felt safe, even if that moment was brief. It all changes depending on perspective and that’s what I love about this piece\n\nEdit: I didn't think some post I made 2 years ago when I had just recently got myself out of a toxic friend group would get so popular. I was in a dark place when I wrote this, and I'm so glad that it has brought people together in such a beautiful way. Whoever you are, wherever you are, keep it up, and one day you'll be able to face the light of tomorrow with hope",
        "comment2": "I lost my father the same year this game came out. when I replay the game, this song makes me sad, especially when you play it for Darmani… but it heals me too.\n",
        "comment3": "This song makes me sad. Like a home you can’t quite remember and can never return to....\n",
        "comment4": "it's creepy at first but It gets better later, just shows healing will take time\n",
        "comment5": "This song really embodies the concept of holding space to me. This idea for those who don't know is that instead of trying to cheer somebody up or encourage them or give them hope you just let them share all their sorrows and let out all their pain. You just let them feel all the pain and go through and you just hold up a space for them to let all the pain out.",
        "comment6": "Healing can take time. Just know time is a mysterious essence and we are all slaves to time. Time gives us pain, loss, grief, and death... Time also gives us recovery, healing, patience, and soul resurrection. May love stay in your heart and may you always know how to heal♥♥♥",
        "comment7": "This song is so therapeutic and somber for me. When I'm sad I listen to this to help me know there is good in my life. And when I need to be sad, this song brings me to tears, it reminds me of all I've lost. It reminds me how to heal. About a month ago today, I ended an abusive friendship, one of the hardest things I've had to do. I knew this person my whole life, but they didn't love me, even if I loved them. So when I listen to this song and think about that time, it helps me to remind myself it takes time to heal. Healing from trauma, loss, depression, anxiety, suicidal thoughts, abusive, and life. Not all scars go away, some stay forever. I know I'm not the only one. I hope one day when I look upon my scars that I do not look on them with only somberness but reminds me of how I've grown, and what I got myself out of.",
        "comment8": "\"Whenever there is a meeting, a parting shall follow. But that parting needs not last forever. Whether a parting be forever or merely for a short while... that is up to you.\"",
        "comment9": "This song hits harder when you’ve been met with a terrible fate\n",
        "comment10": "My friend Zita (Yvette) passed away this year. This one is for her. She loved The Legend of Zelda ❤\n\n",
        "comment11": "This song will forever resonate within me. This is one of those tracks (among many others) I come to whenever I'm feeling a bit down..and the main reason I feel down these days is because my Dad is no longer here. \n\nThis song helps me to remember some happy memories of him. Simple little things like helping him with the grocery shopping and then grabbing a sandwich on the way home and eat and watch a little TV with him before he had to go to work. And of course, my favorite, playing Punch Out Wii together. We liked taking turns going through the circuits and watching each other fight different boxers.\n\nIt's bittersweet, but it does help me when times are getting tough. Love you Dad..I really hope there's an afterlife because I want to hug you again old man.",
        "comment12": "When my grandfather passed my friends dragged me to a zelda symphony awhile later this played and I literally cried but it was good.. like I felt better while hearing this i felt comfort and closure.. Today I got news about my cousin passing away.. this one hurt so hard, she was younger then me and it just devastated me... this song helps take the pain away and I just think of the good times we had and I'll cherish them forever.",
        "comment13": "When I listen to this, I return to a house, a house out in texas with my mom, sister, and dog, I feel the feeling of waking up early to run to the Wii and resume my play through of Majora’s Mask, back in a simpler time, back when life was good.\nI haven’t cried in a while, but if anything is close to bringing me to tears, it’s this song\n\n...and also that I’m wasting my life and such but that’s besides the point",
        "comment14": "I recently lost a member of my family. It was very sudden, and she was perfectly healthy the day before. Or so it seemed. I haven't really let myself feel it because I'm not really in a position where I can lose myself to the pain.\n\nSomehow I knew I needed to listen to this. It's very, very gently pulling out the sadness, and letting me feel it in reasonable amounts.",
        "comment15": "This song really calls for healing, a part tells you that you have made mistakes in life that have affected you, but that can be healed and start living a new life!... Make mistakes, heal and start living again.. It's amazing with just the melody I can think of this.\n"
    },
    {
        "gametitle": "Undertale",
        "id": "undertale",
        "path": "undertale",
        "songname": "\"Fallen Down (Reprise)\"",
        "composername": "Toby Fox",
        "system": "All Platforms",
        "releaseyear": 2015,
        "image": "undertale.png",
        "music": "undertale_fallenDown.mp3",
        "comment1": "This song was my best friends favorite. I didnt play undertale and he was so upset about it, always telling me that I should play it. In the end of 9th grade, he walked up to me and said: \"You should play it even when I'll be gone.\" I thought he said it because he wanted to go to college. Next day his mom called me. Turned out he got stage 4 cancer just before ending the 9th grade. He didnt want to tell me about it for unknown reasons but it's understandable. Immediately after that I played the entire game and wrote a note: \"You were right. Miss you.\" and put it on his balcony. Next day it was gone like he took it. It's been 8 years and this song popped up in my recommendations and I remembered him. Thank you, Toby Fox. And I miss you Brian. I hope you are having fun over there, you are in better place now. \nEdit: thanks y’all for support, I really appreciate that and I’m sure Brian does too.",
        "comment2": "This song is sad but happy. It makes me feel emotions that I can’t explain. Right now with the current situation in the world things have been tough for a lot of people, and i guess this song kinda helps me escape all my problems and troubles, even if it’s temporary. Have a good day/night guys. Keep fighting.\n",
        "comment3": "It's already 2023. How fast time flies. It feels like just yesterday I was crying from the end of this game",
        "comment4": "This song feels like every emotion ever all at once\n",
        "comment5": "i wish i could time travel.\ni wish i could travel back,\nto a time when i didn’t know this song.\ndiscovering it for the first time,\nmy ears filled with music,\nas toriel appears on screen.\nnot knowing how important this song will be,\nlater in life, when everything falls apart.\ni zone out for a minute, until i hear the voice.\nof toriel: ‘come with me, child.’\n\nthank you",
        "comment6": "This song always reminds me to an old pet/best friend. He put me out of some dark times, and I always thought he fell down on me to save me. You'll always be loved and remembered. \n\nRest in peace, Ojillos.",
        "comment7": "I’m not that old but damn this makes me feel old. it’s crazy how much everything has changed. God dammit I don’t wanna cry anymore",
        "comment8": "As someone who has never played Undertale, this is still so nostalgic\n",
        "comment9": "I feel a indescribable feeling of nostalgia and sadness, but like im in the between of experiencing sadness and happiness/acceptance.\nLike closure.",
        "comment10": "My little brother showed me this song, it was one of his favorite songs when he was obsessed with undertale.\nNow that he is older, it feels like he is always mad at me for some reason. \nOr he is always too busy to goof around like we used to.\nI just wish things would go back to how they used to be.... Listening to this song literally makes me cry, remembering all the memories that me and my brother had built together. Playing games for hours. Not a care in the world...",
        "comment11": "this song is so nostalgic for me. I used to hear it every day, and hearing it once again makes me happy, and want to cry at the same time. I wish whoever is reading this well, and a long happy life ❤",
        "comment12": "This song gives me multiple emotions mixed into one that I can’t describe. It’s like sadness, joy, and love. I don’t even know anymore. I feel like I wanna cry and let all the pain that I went through of living out.. I don’t know.\n\nEdit: I found it. It’s regret.",
        "comment13": "Its like a memory that you try to forget but it still comes back to you.\n\n",
        "comment14": "My God, this song is beautiful, it is my favorite, I am overwhelmed with emotions! I listen almost every day..) fully describes my life ;)",
        "comment15": "My dog was diagnosed with bone cancer a month ago. She had had it for a while and the doctor said she probably didn't have lone, and my family agreed to put her down if she was suffering. During this period, I would just stay up at night and listen to this and feel a variety of emotions, from fear, to uncomfortable, to sadness and would just let it all out. Exactly seven days later, I was pulled out of class and sent home early and had the opportunity to stay with her for two more hours before she was inevitably euthanized and freed from the chains holding her to this mortal plane. Callie, we miss you dearly and those eight years were full of many moments, both sad and happy. May death do us part but I do hope we can meet again one day, perhaps in a happier situation.\n\nEdit: Thank you all for your kind words. I'm back here as I reminisce on the past year in the final hour before 2023, hard to believe she won't be here for this year. I'll miss her and relistening to this hurts like hell, but she's in a better place now, running around without a care in the world. It's been 2 months as of 1/2/2023 which is honestly hard to believe.\n\nUpdate: 3/31/2023. It's really crazy that in just about a month, it'll have been half a year. I'm off to High School very soon and that has it's ups and downs but I've recently kept on relistening to this as I've done my yearly replay of UNDERTALE. It gives me a strange feeling, not of great sadness nor fear or uncomfortableness like I once felt. It just feels weird, like as if I've finally moved on from that. It still does make me not happy but not to the extent it did in the past. I feel off and numb when listening to this."
    }
]